results/wrk2/plaintextget.txt
11:24:46 {play-2.6-with-akka-http} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R17800 -L -v http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 11.047ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 11.108ms, rate sampling interval: 29ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.66ms  35.01ms   94.83%
    Req/Sec     9.06k   559.59    12.52k    90.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.88ms
 75.000%    2.51ms
 90.000%    3.19ms
 99.000%   10.98ms
 99.900%   17.98ms
 99.990%   22.21ms
 99.999%   30.46ms
100.000%   35.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.138     0.000000            1         1.00
       1.051     0.100000        88856         1.11
       1.294     0.200000       177703         1.25
       1.496     0.300000       266456         1.43
       1.687     0.400000       355157         1.67
       1.884     0.500000       444064         2.00
       1.991     0.550000       488550         2.22
       2.105     0.600000       533415         2.50
       2.225     0.650000       577254         2.86
       2.359     0.700000       621656         3.33
       2.509     0.750000       666146         4.00
       2.593     0.775000       688530         4.44
       2.683     0.800000       710667         5.00
       2.783     0.825000       732606         5.71
       2.897     0.850000       754854         6.67
       3.029     0.875000       776864         8.00
       3.105     0.887500       788079         8.89
       3.189     0.900000       799185        10.00
       3.283     0.912500       810103        11.43
       3.399     0.925000       821245        13.33
       3.547     0.937500       832391        16.00
       3.647     0.943750       837904        17.78
       3.775     0.950000       843406        20.00
       3.959     0.956250       848947        22.86
       4.251     0.962500       854531        26.67
       4.683     0.968750       860057        32.00
       4.963     0.971875       862799        35.56
       5.307     0.975000       865587        40.00
       5.739     0.978125       868371        45.71
       6.371     0.981250       871122        53.33
       7.511     0.984375       873896        64.00
       8.319     0.985938       875291        71.11
       9.287     0.987500       876681        80.00
      10.335     0.989062       878060        91.43
      11.391     0.990625       879444       106.67
      12.439     0.992188       880841       128.00
      12.975     0.992969       881525       142.22
      13.495     0.993750       882225       160.00
      14.079     0.994531       882916       182.86
      14.623     0.995313       883606       213.33
      15.279     0.996094       884305       256.00
      15.599     0.996484       884648       284.44
      15.895     0.996875       884992       320.00
      16.231     0.997266       885339       365.71
      16.559     0.997656       885691       426.67
      16.895     0.998047       886034       512.00
      17.103     0.998242       886223       568.89
      17.279     0.998437       886384       640.00
      17.487     0.998633       886558       731.43
      17.727     0.998828       886730       853.33
      18.031     0.999023       886904      1024.00
      18.223     0.999121       886989      1137.78
      18.463     0.999219       887073      1280.00
      18.767     0.999316       887163      1462.86
      19.087     0.999414       887246      1706.67
      19.471     0.999512       887333      2048.00
      19.775     0.999561       887377      2275.56
      20.047     0.999609       887423      2560.00
      20.271     0.999658       887463      2925.71
      20.687     0.999707       887506      3413.33
      21.039     0.999756       887550      4096.00
      21.199     0.999780       887572      4551.11
      21.407     0.999805       887593      5120.00
      21.631     0.999829       887616      5851.43
      21.807     0.999854       887636      6826.67
      21.983     0.999878       887659      8192.00
      22.111     0.999890       887670      9102.22
      22.239     0.999902       887681     10240.00
      22.335     0.999915       887691     11702.86
      22.463     0.999927       887702     13653.33
      22.671     0.999939       887712     16384.00
      22.991     0.999945       887718     18204.44
      23.215     0.999951       887723     20480.00
      24.175     0.999957       887729     23405.71
      25.103     0.999963       887734     27306.67
      26.159     0.999969       887739     32768.00
      26.751     0.999973       887742     36408.89
      27.119     0.999976       887745     40960.00
      28.175     0.999979       887748     46811.43
      28.191     0.999982       887750     54613.33
      28.927     0.999985       887753     65536.00
      29.327     0.999986       887754     72817.78
      30.127     0.999988       887756     81920.00
      30.463     0.999989       887757     93622.86
      30.991     0.999991       887758    109226.67
      31.391     0.999992       887760    131072.00
      31.391     0.999993       887760    145635.56
      32.223     0.999994       887761    163840.00
      32.671     0.999995       887762    187245.71
      32.671     0.999995       887762    218453.33
      33.279     0.999996       887763    262144.00
      33.279     0.999997       887763    291271.11
      34.271     0.999997       887764    327680.00
      34.271     0.999997       887764    374491.43
      34.271     0.999998       887764    436906.67
      34.975     0.999998       887765    524288.00
      34.975     0.999998       887765    582542.22
      34.975     0.999998       887765    655360.00
      34.975     0.999999       887765    748982.86
      34.975     0.999999       887765    873813.33
      35.039     0.999999       887766   1048576.00
      35.039     1.000000       887766          inf
#[Mean    =        2.181, StdDeviation   =        1.657]
#[Max     =       35.008, Total count    =       887766]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1066910 requests in 1.00m, 132.27MB read
Requests/sec:  17781.84
Transfer/sec:      2.20MB