results/wrk2/plaintextpost.txt
10:36:14 {play-2.6-with-netty} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R9900 -L -v -s src/test/lua/plaintextPost.lua http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.642ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.610ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.53ms    6.68ms  71.74ms   91.27%
    Req/Sec     5.22k   593.96     8.44k    75.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.63ms
 75.000%    4.55ms
 90.000%   10.31ms
 99.000%   37.57ms
 99.900%   53.28ms
 99.990%   64.00ms
 99.999%   68.29ms
100.000%   71.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.214     0.000000            1         1.00
       2.175     0.100000        49430         1.11
       2.793     0.200000        98911         1.25
       3.113     0.300000       148443         1.43
       3.375     0.400000       197609         1.67
       3.627     0.500000       247193         2.00
       3.759     0.550000       271871         2.22
       3.901     0.600000       296383         2.50
       4.067     0.650000       321129         2.86
       4.271     0.700000       345804         3.33
       4.547     0.750000       370328         4.00
       4.739     0.775000       382769         4.44
       4.987     0.800000       395005         5.00
       5.375     0.825000       407417         5.71
       6.127     0.850000       419701         6.67
       7.699     0.875000       432051         8.00
       8.815     0.887500       438207         8.89
      10.311     0.900000       444404        10.00
      12.183     0.912500       450573        11.43
      14.319     0.925000       456722        13.33
      16.879     0.937500       462895        16.00
      18.319     0.943750       466004        17.78
      19.887     0.950000       469069        20.00
      21.647     0.956250       472161        22.86
      23.551     0.962500       475264        26.67
      25.743     0.968750       478338        32.00
      26.959     0.971875       479878        35.56
      28.351     0.975000       481418        40.00
      29.935     0.978125       482953        45.71
      31.503     0.981250       484501        53.33
      33.535     0.984375       486049        64.00
      34.623     0.985938       486832        71.11
      35.679     0.987500       487601        80.00
      36.831     0.989062       488357        91.43
      38.079     0.990625       489131       106.67
      39.615     0.992188       489902       128.00
      40.447     0.992969       490286       142.22
      41.343     0.993750       490669       160.00
      42.335     0.994531       491058       182.86
      43.263     0.995313       491450       213.33
      44.255     0.996094       491829       256.00
      44.831     0.996484       492019       284.44
      45.567     0.996875       492214       320.00
      46.271     0.997266       492406       365.71
      47.295     0.997656       492599       426.67
      48.511     0.998047       492790       512.00
      49.183     0.998242       492885       568.89
      50.079     0.998437       492981       640.00
      50.975     0.998633       493079       731.43
      51.999     0.998828       493174       853.33
      53.471     0.999023       493270      1024.00
      54.303     0.999121       493319      1137.78
      55.135     0.999219       493367      1280.00
      56.223     0.999316       493415      1462.86
      57.343     0.999414       493464      1706.67
      58.303     0.999512       493512      2048.00
      58.719     0.999561       493537      2275.56
      59.295     0.999609       493561      2560.00
      59.871     0.999658       493584      2925.71
      60.479     0.999707       493608      3413.33
      61.343     0.999756       493633      4096.00
      61.663     0.999780       493644      4551.11
      61.855     0.999805       493656      5120.00
      62.207     0.999829       493668      5851.43
      62.751     0.999854       493680      6826.67
      63.263     0.999878       493693      8192.00
      63.615     0.999890       493698      9102.22
      63.999     0.999902       493704     10240.00
      64.319     0.999915       493710     11702.86
      64.671     0.999927       493716     13653.33
      65.087     0.999939       493722     16384.00
      65.535     0.999945       493725     18204.44
      65.983     0.999951       493728     20480.00
      66.367     0.999957       493731     23405.71
      66.623     0.999963       493734     27306.67
      67.199     0.999969       493737     32768.00
      67.647     0.999973       493740     36408.89
      67.647     0.999976       493740     40960.00
      68.159     0.999979       493742     46811.43
      68.223     0.999982       493746     54613.33
      68.223     0.999985       493746     65536.00
      68.223     0.999986       493746     72817.78
      68.223     0.999988       493746     81920.00
      68.287     0.999989       493747     93622.86
      68.927     0.999991       493748    109226.67
      69.759     0.999992       493749    131072.00
      69.759     0.999993       493749    145635.56
      69.759     0.999994       493749    163840.00
      70.527     0.999995       493751    187245.71
      70.527     0.999995       493751    218453.33
      70.527     0.999996       493751    262144.00
      70.527     0.999997       493751    291271.11
      70.527     0.999997       493751    327680.00
      70.527     0.999997       493751    374491.43
      70.527     0.999998       493751    436906.67
      71.807     0.999998       493752    524288.00
      71.807     1.000000       493752          inf
#[Mean    =        5.534, StdDeviation   =        6.676]
#[Max     =       71.744, Total count    =       493752]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  593402 requests in 1.00m, 73.57MB read
Requests/sec:   9890.01
Transfer/sec:      1.23MB